01/16~01/19
1. Python 기초 => 조건문 반복문 활용한 매우 간단한 조건 활용
=> 각자 조사하여 코드와 주석처리하여 정리해오기
2. Pandas 기초 => Pandas, numpy를 이용하여 데이터 분석에 필요한 함수를 정리해보고 Olympics 데이터 혹은 다른 데이터를 이용하여 분석
=> 데이터를 Pandas, numpy를 이용해 각자 분석하고 주석처리 및 column 설명
3. 데이터 분석과정 중 데이터간 연관성, 설명을 위한 상관계수, 전처리 등 필요한 내용 정리해보기 + boston housing 데이터 선형회귀 모델 구현 및 해석
=> boston housing 데이터를 각자 전처리 분석하고 선형회귀
=>결과 해석 및 설명 자료
------------------------------------------------------------------------

01/19~01/22
4. breast_cancer 데이터 활용 실습 진행 
=> KNN, Decision Tree, Random Forest 이외에 다른 분류 이용해보거나 조사, 해당 기법들 각각 설명, 결과 설명 등
5. 3, 4에서 만들었던 모델의 성능을 높이는 방법을 각자 희망하는대로 하여 성능을 높이고 그 내용과 코드를 주석과 마크다운을 이용해서 정리하기

변수에 값을 저장할 때 [ ](대괄호)로 묶어주면 리스트가 되며 각 값은 ,(콤마)로 구분해줍니다.

리스트 = [값, 값, 값]

In [1]:
import pandas as pd

## 시리즈

In [2]:
customer=['홍길동', '김수진', '김철수']
pd.Series(customer)

0    홍길동
1    김수진
2    김철수
dtype: object

In [3]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

### 인덱스

In [5]:
customer=pd.Series(['홍길동','김수진','김철수'],
                  index=['10011','10012','10013'])
customer

10011    홍길동
10012    김수진
10013    김철수
dtype: object

In [7]:
customer_no_name={'10001':'홍인표', 
                  '10002':'김학동',
                  '10003':'안은영',
                  '10004':'고길동'}
cust_info=pd.Series(customer_no_name)
cust_info

10001    홍인표
10002    김학동
10003    안은영
10004    고길동
dtype: object

In [8]:
cust_info.index

Index(['10001', '10002', '10003', '10004'], dtype='object')

In [13]:
#인덱스를 활용하여 추출, series로 변환
customer_no_name={'10001':'홍인표','10002':'김학동','10003':'안은영','10004':'고길동'}
cust_info=pd.Series(customer_no_name, index=['10001','10003','10004'])
cust_info

10001    홍인표
10003    안은영
10004    고길동
dtype: object

In [14]:
#iloc: 실제 순서
cust_info.iloc[0]

'홍인표'

In [15]:
#loc: 인덱스
cust_info.loc['10001']

'홍인표'

In [19]:
#추가: append 또는 concat 사용
customer_2=['홍길동', '김수진', '김철수']
customer_2=pd.Series(customer_2)

customer_list=cust_info.append(customer_2)
customer_list
#customer_list=pd.concat([cust_info,customer_2])

/var/folders/dk/3v6dmwm50cd7177yfz7bz0pm0000gn/T/ipykernel_36914/1950951689.py:5: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_list=cust_info.append(customer_2)

10001    홍인표
10003    안은영
10004    고길동
0        홍길동
1        김수진
2        김철수
dtype: object

## 데이터프레임

In [20]:
customer_1=pd.Series({'Name': '홍길동',
                     'Phone_no': '01011112222',
                     '1Q_point': 90})
customer_2=pd.Series({'Name':'김수진',
                     'Phone_no': '01012341234',
                     '1Q_point': 70})
customer_3=pd.Series({'Name':'홍길동',
                     'Phone_no': '01099998888',
                     '1Q_point': 22.5})

In [23]:
df = pd.DataFrame([customer_1,customer_2,customer_3])
df

  Name     Phone_no  1Q_point
0  홍길동  01011112222      90.0
1  김수진  01012341234      70.0
2  홍길동  01099998888      22.5

In [24]:
#인덱스 변경
df=pd.DataFrame([customer_1, customer_2, customer_3],
               index=['10001','10002','10003'])
df

      Name     Phone_no  1Q_point
10001  홍길동  01011112222      90.0
10002  김수진  01012341234      70.0
10003  홍길동  01099998888      22.5

In [44]:
#같은 실행결과 코드
df=pd.DataFrame([{'Name': '홍길동',
                  'Phone_no': '01011112222',
                  '1Q_point': 90},
                 {'Name':'김수진',
                  'Phone_no': '01012341234',
                  '1Q_point': 70},
                 {'Name':'홍길동',
                  'Phone_no': '01099998888',
                  '1Q_point': 22.5}],
                 index=['10001','10002','10003']
                )

In [28]:
df.loc['10002']

Name                김수진
Phone_no    01012341234
1Q_point           70.0
Name: 10002, dtype: object

In [25]:
#a:b -> 원래 인덱스 기준 a부터 b-1 출력
df.iloc[0:2]

      Name     Phone_no  1Q_point
10001  홍길동  01011112222      90.0
10002  김수진  01012341234      70.0

In [29]:
#열출력
df['Name']

10001    홍길동
10002    김수진
10003    홍길동
Name: Name, dtype: object

In [30]:
#대괄호 사용해서 열 여러개 출력 가능
df[['Name','1Q_point']]

      Name  1Q_point
10001  홍길동      90.0
10002  김수진      70.0
10003  홍길동      22.5

In [31]:
df.iloc[:,:] #[행,열], 숫자를 안적으면 전체 출력

      Name     Phone_no  1Q_point
10001  홍길동  01011112222      90.0
10002  김수진  01012341234      70.0
10003  홍길동  01099998888      22.5

In [32]:
df.iloc[:,0:2]

      Name     Phone_no
10001  홍길동  01011112222
10002  김수진  01012341234
10003  홍길동  01099998888

In [33]:
df['Name']=='홍길동'

10001     True
10002    False
10003     True
Name: Name, dtype: bool

In [34]:
df[df['Name']=='김수진']

      Name     Phone_no  1Q_point
10002  김수진  01012341234      70.0

In [35]:
(df['Name']=='홍길동')&(df['1Q_point']>50)

10001     True
10002    False
10003    False
dtype: bool

In [36]:
#대괄호로 다시 묶으면 데이터 프레임 형태로 출력
df[(df['Name']=='홍길동')&(df['1Q_point']>50)]

      Name     Phone_no  1Q_point
10001  홍길동  01011112222      90.0

## drop

In [37]:
df.drop('10001')

      Name     Phone_no  1Q_point
10002  김수진  01012341234      70.0
10003  홍길동  01099998888      22.5

In [38]:
#대괄호로 묶어서 여러개의 행 삭제 가능
df.drop(['10001','10002'])

      Name     Phone_no  1Q_point
10003  홍길동  01099998888      22.5

In [39]:
#columns를 이용해 열 삭제
df.drop(columns='Phone_no')

      Name  1Q_point
10001  홍길동      90.0
10002  김수진      70.0
10003  홍길동      22.5

In [40]:
#대괄호로 묶어서 여러개의 열 삭제 가능
df.drop(columns=['Phone_no','1Q_point'])

      Name
10001  홍길동
10002  김수진
10003  홍길동

### inplace=True 이용하면 변경한 프레임 유지

In [41]:
df

      Name     Phone_no  1Q_point
10001  홍길동  01011112222      90.0
10002  김수진  01012341234      70.0
10003  홍길동  01099998888      22.5

In [45]:
df.drop(columns='1Q_point', inplace=True)

In [46]:
df

      Name     Phone_no
10001  홍길동  01011112222
10002  김수진  01012341234
10003  홍길동  01099998888

### 열 이름 변경

In [47]:
df.rename(columns={'Phone_no':'Number'})

      Name       Number
10001  홍길동  01011112222
10002  김수진  01012341234
10003  홍길동  01099998888

### 새로운 열 추가

In [48]:
df['1Q_point']=[80,40,100]
df

      Name     Phone_no  1Q_point
10001  홍길동  01011112222        80
10002  김수진  01012341234        40
10003  홍길동  01099998888       100

## 데이터프레임 합치기

In [49]:
df_customer = pd.DataFrame([{'Name': '홍길동', 'Phone_no': '01011112222'}, 
                            {'Name': '김수진', 'Phone_no': '01012341234'},
                            {'Name': '안은영', 'Phone_no': '01099998888'}],
                            index=['20190001', '20190002', '20190003'])

In [50]:
df_point = pd.DataFrame([{'Name': '김개똥', '1Q_point': 90,'final_point': 80}, 
                         {'Name': '홍길동', '1Q_point': 70,'final_point': 55},
                         {'Name': '이가은', '1Q_point': 22.5,'final_point': 95.5}],
                        index=['20190002', '20190001', '20193333'])

In [51]:
pd.merge(df_customer,df_point,how='outer',left_index=True,right_index=True)
#합집합으로 합치고 해당 데이터가 없으면 NaN

         Name_x     Phone_no Name_y  1Q_point  final_point
20190001    홍길동  01011112222    홍길동      70.0         55.0
20190002    김수진  01012341234    김개똥      90.0         80.0
20190003    안은영  01099998888    NaN       NaN          NaN
20193333    NaN          NaN    이가은      22.5         95.5

In [52]:
pd.merge(df_customer,df_point,how='inner',left_index=True,right_index=True)
#교집합

         Name_x     Phone_no Name_y  1Q_point  final_point
20190001    홍길동  01011112222    홍길동      70.0         55.0
20190002    김수진  01012341234    김개똥      90.0         80.0

In [53]:
pd.merge(df_customer,df_point,how='left',left_index=True,right_index=True)
#왼쪽에 입력한 데이터 기준

         Name_x     Phone_no Name_y  1Q_point  final_point
20190001    홍길동  01011112222    홍길동      70.0         55.0
20190002    김수진  01012341234    김개똥      90.0         80.0
20190003    안은영  01099998888    NaN       NaN          NaN

In [54]:
pd.merge(df_customer,df_point,how='right',left_index=True,right_index=True)
#오른쪽 기준

         Name_x     Phone_no Name_y  1Q_point  final_point
20190002    김수진  01012341234    김개똥      90.0         80.0
20190001    홍길동  01011112222    홍길동      70.0         55.0
20193333    NaN          NaN    이가은      22.5         95.5

In [64]:
df=pd.read_csv('2_olympics.csv',header=1)

In [65]:
#위에서 5개의 행 출력
df.head()

,Unnamed: 0,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [66]:
df.head(10) #숫자 지정 가능

,Unnamed: 0,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
5,Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
6,Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
7,Azerbaijan (AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
8,Bahamas (BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12
9,Bahrain (BRN),8,0,0,1,1,0,0,0,0,0,8,0,0,1,1

In [67]:
#아래에서 출력
df.tail()

,Unnamed: 0,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
142,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
143,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
144,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
145,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
146,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [69]:
df.drop(index=146,inplace=True)
#마지막 행: 전체를 합한 행이므로 삭제

In [70]:
df.sum()

Unnamed: 0        Afghanistan (AFG)Algeria (ALG)Argentina (ARG)A...
№ Summer                                                       1954
01 !                                                           4809
02 !                                                           4775
03 !                                                           5130
Total                                                         14714
№ Winter                                                        963
01 !.1                                                          959
02 !.1                                                          958
03 !.1                                                          948
Total.1                                                        2865
№ Games                                                        2917
01 !.2                                                         5768
02 !.2                                                         5733
03 !.2                                                         6078
Combined total                                                17579
dtype: object

In [71]:
df.sum(axis=1) #행기준

/var/folders/dk/3v6dmwm50cd7177yfz7bz0pm0000gn/T/ipykernel_36914/386661471.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1) #행기준

0       34
1       90
2      362
3       70
4       52
      ...
141    408
142     14
143     32
144     58
145     74
Length: 146, dtype: int64

In [72]:
df.describe()
#여러 지표 제공
#count: sum과 다름, 단순한 갯수 세기

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
count,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000
mean,13.383562,32.938356,32.705479,35.136986,100.780822,6.595890,6.568493,6.561644,6.493151,19.623288,19.979452,39.506849,39.267123,41.630137,120.404110
std,7.006657,96.745184,80.648421,77.118416,252.700436,7.349012,18.975086,18.606996,17.499654,54.640914,13.084062,109.932471,93.984393,89.826117,291.988913
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,8.000000,0.000000,1.000000,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,11.000000,0.000000,1.000000,1.000000,2.250000
50%,13.000000,3.000000,4.000000,6.000000,12.000000,5.000000,0.000000,0.000000,0.000000,0.000000,15.000000,3.000000,4.000000,6.500000,12.000000
75%,18.000000,23.000000,26.750000,28.750000,85.250000,10.000000,0.750000,1.750000,1.000000,4.750000,26.000000,24.500000,28.000000,29.000000,87.750000
max,27.000000,976.000000,757.000000,666.000000,2399.000000,22.000000,118.000000,111.000000,100.000000,329.000000,49.000000,1072.000000,859.000000,750.000000,2681.000000

In [74]:
#열이름 변경
df.rename(columns={'Unnamed: 0':'Team',
                  '№ Summer':'Summer','01 !':'01_S',
                  '02 !':'02_S','03 !':'03_S', 'Total':'Total_S',
                  '№ Winter':'Winter','01 !.1':'01_W',
                  '02 !.1':'02_W','03 !.1':'03_W', 'Total.1':'Total_W',
                  '№ Games':'Combined','01 !.2':'01_C',
                  '02 !.2':'02_C','03 !.2':'03_C',
                   'Combined total':'Total_c'},inplace=True)

In [75]:
df.iloc[0,:]

Team        Afghanistan (AFG)
Summer                     13
01_S                        0
02_S                        0
03_S                        2
Total_S                     2
Winter                      0
01_W                        0
02_W                        0
03_W                        0
Total_W                     0
Combined                   13
01_C                        0
02_C                        0
03_C                        2
Total_c                     2
Name: 0, dtype: object

In [78]:
#'01_s' 값이 최대인 행 출력
df[df['01_S']==df['01_S'].max()]

,Team,Summer,01_S,02_S,03_S,Total_S,Winter,01_W,02_W,03_W,Total_W,Combined,01_C,02_C,03_C,Total_c
135,United States (USA) [P] [Q] [R] [Z],26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681

In [79]:
#조건에 맞는 행 출력
df[(df['01_S']>0)&(df['01_C']>300)]

,Team,Summer,01_S,02_S,03_S,Total_S,Winter,01_W,02_W,03_W,Total_W,Combined,01_C,02_C,03_C,Total_c
106,Soviet Union (URS) [URS],9,395,319,296,1010,9,78,57,59,194,18,473,376,355,1204
135,United States (USA) [P] [Q] [R] [Z],26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681